#!/bin/sh

#
# Авторские права © 2015 принадлежат первоначальным авторам.
#
# Распространяется под лицензией Apache License, Version 2.0 («Лицензия»);
# Вы не можете использовать этот файл иначе, чем в соответствии с условиями лицензии.
# Вы можете получить копию лицензии по адресу
#
# https://www.apache.org/licenses/LICENSE-2.0
#
# Если иное не требуется применимым законодательством или не согласовано в письменной форме, программное обеспечение
# Распространяется под лицензией «КАК ЕСТЬ».
# БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ.
# См. лицензию для получения информации о конкретных условиях использования и правах доступа.
# Ограничения, предусмотренные лицензией.
#
# Идентификатор лицензии SPDX: Apache-2.0
#

##############################################################################
#
# Скрипт запуска gradlew для POSIX, сгенерированный Gradle.
#
# Важно для бега:
#
# (1) Для запуска этого скрипта вам потребуется оболочка, совместимая с POSIX. Если ваш /bin/sh —
# не соответствует требованиям, но у вас есть другая соответствующая требованиям оболочка, например, ksh или
# Чтобы запустить этот скрипт в bash, введите имя оболочки перед всем содержимым.
# командная строка, например:
#
# ksh gradlew
#
# Busybox и аналогичные упрощенные оболочки НЕ будут работать, потому что этот скрипт
# Требует наличия всех этих функций оболочки POSIX:
# * функции;
# * расширения «$var», «${var}», «${var:-default}», «${var+SET}»,
# «${var#prefix}», «${var%suffix}» и «$( cmd )»;
# * Составные команды, имеющие проверяемый код завершения, особенно «case»;
# * Различные встроенные команды, включая «command», «set» и «ulimit».
#
# Важно для установки патчей:
#
# (2) Этот скрипт предназначен для любой оболочки POSIX, поэтому он избегает предоставленных расширений.
# Используется в Bash, Ksh и т. д.; в частности, массивы избегаются.
#
# «Традиционная» практика объединения нескольких параметров в один
# Строки, разделённые пробелами, являются хорошо задокументированным источником ошибок и угроз безопасности.
# проблем, поэтому этого (по большей части) удается избежать путем постепенного накопления
# параметры в "$@", и в конечном итоге передача их в Java.
#
# Где находятся унаследованные переменные среды (DEFAULT_JVM_OPTS, JAVA_OPTS,
# и GRADLE_OPTS) основаны на разделении слов, которое выполняется явно;
# Подробности см. в комментариях.
#
# Существуют настройки для конкретных операционных систем, таких как AIX, CygWin,
# Дарвин, MinGW и NonStop.
#
# (3) Этот скрипт генерируется из шаблона Groovy
# https://github.com/gradle/gradle/blob/3d91ce3b8caaf77ad09f381f43615b715b53f72c/platforms/jvm/plugins-application/src/main/resources/org/gradle/api/internal/plugins/unixStartScript.txt
# в рамках проекта Gradle.
#
# Gradle можно найти по адресу https://github.com/gradle/gradle/.
#
##############################################################################

# Попытка установить APP_HOME

# Разрешение ссылок: $0 может быть ссылкой
app_path=$0

# Это необходимо для последовательного соединения символических ссылок.
пока
    APP_HOME=${app_path%"${app_path##*/}"} # оставляет в конце /; пустым, если нет начального пути
    [ -h "$app_path" ]
делать
    ls=$( ls -ld "$app_path" )
    link=${ls#*' -> '}
    case $link in #(
      /*) app_path=$link ;; #(
      *) app_path=$APP_HOME$link ;;
    esac
сделанный

# Обычно не используется
# shellcheck disable=SC2034
APP_BASE_NAME=${0##*/}
# Отбрасываем стандартный вывод команды cd, если переменная $CDPATH задана (https://github.com/gradle/gradle/issues/25036)
APP_HOME=$( cd -P "${APP_HOME:-./}" > /dev/null && printf '%s\n' "$PWD" ) || exit

# Используйте максимально доступное значение или установите MAX_FD != -1, чтобы использовать это значение.
MAX_FD=максимум

предупреждать () {
    echo "$*"
} >&2

die() {
    эхо
    echo "$*"
    эхо
    выход 1
} >&2

# Поддержка, специфичная для ОС (должна быть 'true' или 'false').
cygwin=false
msys=false
дарвин=ложь
nonstop=false
case "$( uname )" in #(
  CYGWIN* ) cygwin=true ;; #(
  Darwin* ) darwin=true ;; #(
  MSYS* | MINGW* ) msys=true ;; #(
  БЕЗ ПЕРЕРЫВА* ) nonstop=true ;;
esac



# Определяем команду Java для запуска JVM.
если [ -n "$JAVA_HOME" ] ; тогда
    if [ -x "$JAVA_HOME/jre/sh/java" ] ; then
        # В JDK от IBM на AIX используются странные расположения исполняемых файлов.
        JAVACMD=$JAVA_HOME/jre/sh/java
    еще
        JAVACMD=$JAVA_HOME/bin/java
    фи
    если [ ! -x "$JAVACMD" ] ; тогда
        die "ОШИБКА: переменная JAVA_HOME установлена ​​на недопустимый каталог: $JAVA_HOME

Пожалуйста, установите переменную JAVA_HOME в вашей среде в соответствии с заданными параметрами.
"Расположение вашей установки Java."
    фи
еще
    JAVACMD=java
    if ! command -v java >/dev/null 2>&1
    затем
        die "ОШИБКА: переменная JAVA_HOME не установлена, и в вашем PATH не найдена команда 'java'."

Пожалуйста, установите переменную JAVA_HOME в вашей среде в соответствии с заданными параметрами.
"Расположение вашей установки Java."
    фи
фи

# По возможности увеличить максимальное количество файловых дескрипторов.
если ! "$cygwin" && ! "$darwin" && ! "$nonstop" ; тогда
    case $MAX_FD in #(
      макс*)
        # В POSIX sh параметр ulimit -H не определен. Поэтому проверяется результат, чтобы убедиться, что все сработало.
        # shellcheck disable=SC2039,SC3045
        MAX_FD=$( ulimit -H -n ) ||
            Предупреждение: «Не удалось запросить максимальное количество файловых дескрипторов».
    esac
    case $MAX_FD in #(
      '' | мягкий) :;; #(
      *)
        # В POSIX sh параметр ulimit -n не определен. Поэтому проверяется результат, чтобы убедиться, что все сработало.
        # shellcheck disable=SC2039,SC3045
        ulimit -n "$MAX_FD" ||
            Предупреждение: "Не удалось установить максимальное количество файловых дескрипторов равным $MAX_FD"
    esac
фи

# Собираем все аргументы для команды java, располагая их в обратном порядке:
# * Аргументы из командной строки
# * название основного класса
# * -classpath
# * -D...настройки имени приложения
# * --module-path (только при необходимости)
# * Переменные среды DEFAULT_JVM_OPTS, JAVA_OPTS и GRADLE_OPTS.

# Для Cygwin или MSYS измените пути на формат Windows перед запуском java
если "$cygwin" || "$msys" ; тогда
    APP_HOME=$( cygpath --path --mixed "$APP_HOME" )

    JAVACMD=$( cygpath --unix "$JAVACMD" )

    # Теперь преобразуем аргументы — временное решение, чтобы ограничиться использованием /bin/sh
    для аргумента do
        если
            case $arg in #(
              -*) false ;; # не трогайте параметры #(
              /?*) t=${arg#/} t=/${t%%/*} # выглядит как путь к файлу POSIX
                    [ -e "$t" ] ;; #(
              *) ЛОЖЬ ;;
            esac
        затем
            arg=$( cygpath --path --ignore --mixed "$arg" )
        фи
        # Прокрутите список аргументов ровно столько раз, сколько указано число
        # аргументов, поэтому каждый аргумент в итоге возвращается в исходное положение, но
        # Возможно, изменено.
        #
        Примечание: цикл `for` захватывает список итераций перед началом своего выполнения, поэтому
        # Изменение позиционных параметров здесь не влияет ни на количество
        # итераций, а также значений, представленных в `arg`.
        shift # удалить старый аргумент
        set -- "$@" "$arg" # push replacement arg
    сделанный
фи


# Добавьте здесь параметры JVM по умолчанию. Вы также можете использовать JAVA_OPTS и GRADLE_OPTS для передачи параметров JVM этому скрипту.
DEFAULT_JVM_OPTS='-Dfile.encoding=UTF-8 "-Xmx64m" "-Xms64m"'

# Собираем все аргументы для команды java:
# * Переменные DEFAULT_JVM_OPTS, JAVA_OPTS и optsEnvironmentVar не могут содержать фрагменты оболочки.
# и любая встроенная оболочка будет экранирована.
# * Например: Пользователь не может ожидать, что ${Hostname} будет развернут, поскольку это переменная окружения и будет
# В командной строке обрабатывается как сам '${Hostname}'.

набор -- \
        "-Dorg.gradle.appname=$APP_BASE_NAME"
        -jar "$APP_HOME/gradle/wrapper/gradle-wrapper.jar" \
        "$@"

# Остановить, если параметр "xargs" недоступен.
if ! command -v xargs >/dev/null 2>&1
затем
    die "xargs is not available"
фи

# Используйте "xargs" для разбора аргументов в кавычках.
#
# При использовании параметра -n1 на каждой строке выводится один аргумент, при этом кавычки и обратные косые черты удаляются.
#
В Bash мы могли бы просто написать:
#
# readarray ARGS < <( xargs -n1 <<<"$var" ) &&
# set -- "${ARGS[@]}" "$@"
#
# Но в оболочке POSIX нет ни массивов, ни подстановки команд, поэтому вместо этого мы
# После обработки каждого аргумента (как строки входных данных для sed) экранируем его обратной косой чертой.
# Символ, который может быть метасимволом оболочки, затем используйте eval для обратного вычисления.
# выполнить этот процесс (сохраняя при этом разделение аргументов) и обернуть
# Все это объединено в единое выражение типа «множество».
#
# Разумеется, это приведет к ошибке, если какая-либо из этих переменных содержит символ новой строки или
# Непревзойденная цитата.
#

eval "set -- $(
        printf '%s\n' "$DEFAULT_JVM_OPTS $JAVA_OPTS $GRADLE_OPTS" |
        xargs -n1 |
        sed ' s~[^-[:alnum:]+,./:=@_]~\\&~g; ' |
        тр '\n' ' '
    )" '"$@"'

исполнительный директор "$JAVACMD" "$@"
